## Week 1

### Syntax to create a table

create table TABLENAME (
    COLUMN1 datatype,
    COLUMN2 datatype,
    COLUMN3 datatype,
    );

# creating a table in SQL

create table COUNTRY (
    ID int,
    CCODE char(2),
    NAME varchar(60)
);

# additional keywords
# varchar is variable length and char is fixed length
# in char, any remaining space is padded with blanks

create table COUNTRY (
    ID int NOT NULL,
    CCODE char(2),
    NAME varchar(60),
    PRIMARY KEY (ID)
);

If a table you're trying to create already exists in database, then you will get an error. To go around this, change the name of your table or drop it from the database.

### SELECT Statement

SELECT statement is used to read and modify data. The statement is a Query which outputs a result set/table.

-> select * from tablename;
-> select <column 1>, <column 2> from tablename;

WHERE clause helps to restrict the result set
can use different comparison operators


-> select ID, CCODE from COUNTRY where ID < 5;
OR
-> select ID, CCODE from COUNTRY where CCODE = 'USA';

### COUNT, DISTINCT, LIMIT functions

COUNT is a built-in function that retrieves the number of rows matching the query criteria
-> select COUNT(*) from tablename;

DISTINCT is used to remove duplicate values from a result set

LIMIT is used for restricting the number of rows retrieved from database

### INSERT Statement

Insert statement is used to add new data/rows to the table. values and columns should be equal

INSERT INTO <tablename> (AUTHOR_ID,FNAME,LNAME,EMAIL,CITY,COUNTRY) VALUES('A2801','Aditya', 'Mujumdar','ammujumd@asu.edu','Tempe', 'USA'),('A2809','Jan', 'Doe','djoe@asu.edu','Tempe', 'USA');

### UPDATE & DELETE Statements

###### UPDATE

After data has been added to the created table, it can be changed using UPDATE

Author_id   FNAME   LNAME        EMAIL        CITY  COUNTRY
A2801      Aditya  Mujumdar ammujumd@asu.edu  Tempe   USA


UPDATE <tablename> SET FNAME = 'Jack' LNAME = 'Doe' WHERE AUTHOR_id = A2801;

###### DELETE

Delete one or more rows from the Table. If you don't specify where condition, all the data in the table will be deleted

DELETE FROM <tablename> WHERE AUTHOR_id IN (A2801);

##### Lab 1: Composing and Running basic SQL queries

drop table INSTRUCTOR;
-- create table INSTRUCTOR
create table INSTRUCTOR(
	ins_id int NOT NULL,
	lastname varchar(50) NOT NULL,
	firstname varchar(50) NOT NULL,
	city varchar(20),
	country char(2),
	PRIMARY KEY (ins_id)
);

INSERT INTO INSTRUCTOR (ins_id, lastname, firstname, city, country) VALUES ('1', 'Ahuja', 'Rav', 'Toronto', 'CA');
INSERT INTO INSTRUCTOR (ins_id, lastname, firstname, city, country) VALUES ('2', 'Chong', 'Raul', 'Toronto', 'CA'), ('3', 'Vasudevan','Hima','Chicago','US');

select * from INSTRUCTOR;
select firstname, lastname from INSTRUCTOR where city = 'Toronto';

update INSTRUCTOR set city = 'Markham' where ins_id = 1;
select * from INSTRUCTOR;

delete from INSTRUCTOR where ins_id in 2;

select * from INSTRUCTOR;

select COUNT(*) from INSTRUCTOR;

## Week 2

### Using String Patterns, Ranges

select firstname from INSTRUCTOR where firstname like 'R%';
-- % is the wildcard
select title, pages from book where pages between 210 and 300;
-- gives title, pages from book where pages are inclusively from 210 to 300

### Sorting Result Set

-- sorted in descending order. if ascending, just don't include 'desc'
select title, pages from book order by title desc

-- column sequence number for pages is 2 so sorts by pages
select title, pages from book order by 2

-- will only show non-repeating countries
select distinct(country) from author

-- how many authors come from the same country. Get the count
select country, count(country) from author group by country
    OR
select country, count(country) as count from author group by country

HAVING clause (works only with the group by clause)
-- check if more than 4 authors from the same country
select country, count(country) as count from author group by country having count(country) > 4

##### Lab 2 String Patterns, Sorting & Grouping

CREATE TABLE EMPLOYEES (
                            EMP_ID CHAR(9) NOT NULL, 
                            F_NAME VARCHAR(15) NOT NULL,
                            L_NAME VARCHAR(15) NOT NULL,
                            SSN CHAR(9),
                            B_DATE DATE,
                            SEX CHAR,
                            ADDRESS VARCHAR(30),
                            JOB_ID CHAR(9),
                            SALARY DECIMAL(10,2),
                            MANAGER_ID CHAR(9),
                            DEP_ID CHAR(9) NOT NULL,
                            PRIMARY KEY (EMP_ID));
                            
  CREATE TABLE JOB_HISTORY (
                            EMPL_ID CHAR(9) NOT NULL, 
                            START_DATE DATE,
                            JOBS_ID CHAR(9) NOT NULL,
                            DEPT_ID CHAR(9),
                            PRIMARY KEY (EMPL_ID,JOBS_ID));

 CREATE TABLE JOBS (
                            JOB_IDENT CHAR(9) NOT NULL, 
                            JOB_TITLE VARCHAR(50) ,
                            MIN_SALARY DECIMAL(10,2),
                            MAX_SALARY DECIMAL(10,2),
                            PRIMARY KEY (JOB_IDENT));

CREATE TABLE DEPARTMENT (
                            DEPT_ID_DEP CHAR(9) NOT NULL, 
                            DEP_NAME VARCHAR(20) ,
                            MANAGER_ID CHAR(9),
                            LOC_ID CHAR(9),
                            PRIMARY KEY (DEPT_ID_DEP));

CREATE TABLE LOCATIONS (
                            LOCT_ID CHAR(9) NOT NULL,
                            DEP_ID_LOC CHAR(9) NOT NULL,
                            PRIMARY KEY (LOCT_ID,DEP_ID_LOC));
                            
-- Query 1: All employees whose address is in Elgin, IL
select * from EMPLOYEES where ADDRESS like '%Elgin,IL';

--Query 2: Born during 1970s
select * from EMPLOYEES where B_DATE like '197%';

-- Query 3: Employees in Department 5 whose salary is between 60k to 70k
select * from EMPLOYEES where DEP_ID = 5 AND SALARY between 60000 and 70000;

--Query 4A: order by department ID
select * from EMPLOYEES order by DEP_ID;

--Query 4B: dep_id descending and within each department ordered alphabetically by last name descending
select * from EMPLOYEES order by DEP_ID desc, L_NAME desc;

--Query 5A: retrieve number of employees in each department
select DEP_ID, count(*) as count from EMPLOYEES group by DEP_ID;

--Query 5B: number of employees in department, and avg employee salary in dept.
select DEP_ID, count(*) as num_employees, avg(SALARY) as "AVG_SALARY" from EMPLOYEES group by DEP_ID;

--Query 5C: Rename columns in Query 5B
select DEP_ID, count(*) as num_employees, avg(SALARY) as "AVG_SALARY" from EMPLOYEES group by DEP_ID; 

--Query 5D: order Query 5C result set by average salary
select DEP_ID, count(*) as num_employees, avg(SALARY) as "AVG_SALARY" from EMPLOYEES group by DEP_ID order by AVG_SALARY;

--Query 5E: limit results in Query 5D to departments with fewer than 4 employees
select DEP_ID, avg(SALARY) as "AVG_SALARY" from EMPLOYEES group by DEP_ID having count(DEP_ID) < 4 order by AVG_SALARY;

--Query 6: similar to 4B but instead of DEP_ID use department name from the DEPARTMENT table

select DEPARTMENT.DEP_NAME, EMPLOYEES.F_NAME, EMPLOYEES.L_NAME from DEPARTMENT, EMPLOYEES where EMPLOYEES.DEP_ID = DEPARTMENT.DEPT_ID_DEP  order by DEP_NAME, L_NAME desc;